CaCuCkA/psoc/Lab_3_2_UART_Led.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "Pin_B3.h"
#include "Pin_B3_aliases.h"
#include "Pin_B2.h"
#include "Pin_B2_aliases.h"
#include "Pin_B1.h"
#include "Pin_B1_aliases.h"
#include "clk.h"
#include "isr_100Hz.h"
#include "PIN_SPI_SS.h"
#include "PIN_SPI_SS_aliases.h"
#include "PIN_SPI_SCLK.h"
#include "PIN_SPI_SCLK_aliases.h"
#include "PIN_SPI_MOSI.h"
#include "PIN_SPI_MOSI_aliases.h"
#include "SPIM.h"
#include "SPIM_PVT.h"
#include "UART.h"
#include "UART_SPI_UART.h"
#include "UART_PINS.h"
#include "UART_SPI_UART_PVT.h"
#include "UART_PVT.h"
#include "UART_BOOT.h"
#include "Pin_D1.h"
#include "Pin_D1_aliases.h"
#include "Pin_D2.h"
#include "Pin_D2_aliases.h"
#include "Pin_D3.h"
#include "Pin_D3_aliases.h"
#include "Pin_D4.h"
#include "Pin_D4_aliases.h"
#include "SPIM_IntClock.h"
#include "UART_SCBCLK.h"
#include "UART_tx.h"
#include "UART_tx_aliases.h"
#include "UART_rx.h"
#include "UART_rx_aliases.h"
#include "cy_em_eeprom.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyDMA.h"
#include "CyLFClk.h"

/*[]*/

